---
kind: property
id: P:Autodesk.Revit.DB.MEPSystem.IsEmpty
zh: 系统
source: html/3c5bb767-5e7a-0080-45e9-c16b161a0e10.htm
---
# Autodesk.Revit.DB.MEPSystem.IsEmpty Property

**中文**: 系统

Indicates if the system is empty or not.

## Syntax (C#)
```csharp
public bool IsEmpty { get; }
```

## Remarks
returns true if the system doesn't contain any components